In [2]:
import pandas as pd
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
data = pd.read_csv(url,sep='|',index_col='user_id')
data

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

# See First 10 and last 10 entry

In [4]:
print("-------------->>>>> First 10 Record <<<--------------\n")
print(data.head(10))
print()
print("-------------->>>>> Last 10 Record <<<<---------------\n")
print(data.tail(10))

-------------->>>>> First 10 Record <<<--------------

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

-------------->>>>> Last 10 Record <<<<---------------

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

# What is the number of observations in the dataset?

In [5]:
print(f"Number of Overvation in dataset is :- {len(data.iloc[::,0])}")

Number of Overvation in dataset is :- 943

In [ ]:
Number of Column in dataset

In [15]:
print(f" Number of columne in dataset is :-  {len(data.iloc[0])}")

 Number of columne in dataset is :-  4

In [ ]:
Print the Name of All Column

In [14]:
data.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [ ]:
Print the Dataset Index

In [13]:
data.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [ ]:
Print the data type of Each Column

In [12]:
data.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [ ]:
Print only occupaction Column

In [11]:
data['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [ ]:
How Differents Types of Occupaction in Dataset

In [10]:
print(f"Types of Occupation :- {len(data['occupation'].unique())}")

Types of Occupation :- 21

In [ ]:
Dataframe info

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [ ]:
Sumerize the occupaction Column

In [8]:
data['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [ ]:
What is the Mean Age of User

In [7]:
data['age'].mean()

34.05196182396607

In [ ]:
What is the Age with Least Occruction

In [6]:
data['age'].value_counts().idxmin()

7